import random


def generate_meal_with_portion(restricted_calories, num_meals, percentage_distribution):
    # Sample dishes and their corresponding calorie values
    dishes = {
        'จานหลัก': {  "ข้าวสตูว์ไก่ ":    465,
                "ข้าวกุ้งทอดกระเทียมพริกไทย ":    495,
                "ข้าวไก่อบ ":    490,
                "ข้าวขาหมู ":    690,
                "ข้าวไข่เจียว ":    445,
                "ข้าวคลุกกะปิ ":    410,
                "ข้าวแช่ ":    350,
                "ข้าวผัดกระเพรากุ้ง ":    540,
                "ข้าวผัดกระเพราไก่ไข่ดาว ":    630,
                "ข้าวผัดกระเพราหมู ":    580,
                "ข้าวผัดหมู ":    561,
                "ข้าวผัดกุ้งใส่ไข่ ":    595,
                "ข้าวผัดกุนเชียง ":    590,
                "ข้าวผัดแกงเขียวหวานไก่ ":    630,
                "ข้าวผัดคะน้าหมูกรอบ ":    670,
                "ข้าวผัดต้มยำทะเลแห้ง ":    400,
                "ข้าวผัดน้ำพริกกุ้งสด ":    460,
                "ข้าวผัดน้ำพริกลงเรือ ":    605,
                "ข้าวผัดปลาเค็ม ":    405,
                "ข้าวผัดปลาหมึกน้ำพริกเผา ":    535,
                "ข้าวผัดปูใส่ไข่ ":    610,
                "ข้าวผัดผักกระเฉดหมูกรอบ":    600,
                "ข้าวผัดมันกุ้งใส่ไข่ ":    575,
                "ข้าวผัดสับปะรด ":    335,
                "ข้าวผัดไส้กรอก ":    520,
                "ข้าวผัดหมูน้ำพริกเผา ":    665,
                "ข้าวผัดหมูใส่ไข่ ":    660,
                "ข้าวผัดแหนม ":    610,
                "ข้าวผัดอเมริกัน ":    790,
                "ข้าวราดผัดเผ็ดปลาดุก ":    544,
                "ข้าวมันไก่ ":    585,
                "ข้าวมันไก่ทอด ":    695,
                "ข้าวมันส้มตำ เนื้อผัดหวาน ":   590,
                    "ข้าวยำปักษ์ใต้ ":    180,
                    "ข้าวแกงเขียวหวานลูกชิ้น ":    503,
                    "ข้าวแกงไตปลา ":    380,
                    "ข้าวแกงมัสมั่นเนื้อ น":    477,
                    "ข้าวราดหน้าไก่ ":    400,
                    "ข้าวหน้ากุ้งผัดพริดสด ":    540,
                    "ข้าวหน้าเป็ด ":    495,
                    "ข้าวหมกไก่ ":    540,
                    "ข้าวหมูกระเทียม ":    525,
                    "ข้าวหมูแดง ":    560,
                    "ข้าวเหนียวหมูทอด ":    440,
                    "ข้าวเหนียวหมูสวรรค์ ":    480,
                    "ข้าวอบเผือก ":    385,
                          "ครีมซุปไก่ ":    160,
                          "โจ๊กหมู ":    160,
                          "โจ๊กหมู ตับ ไข่ลวก ":    230,
                          "ข้าวเหนียวหมูปิ้ง ":    586,
                          "ข้าวไรซ์เบอรี่ ":    225,
                              "กระเพาะปลา ":    150,
                              "ก๋วยจั๊บ ":    240,
                              "ก๋วยจั๊บญวณ ":    235,
                              "ก๋วยเตี๋ยวแขก ":    380,
                              "ก๋วยเตี๋ยวคั่วไก่ ":    435,
                              "ก๋วยเตี๋ยวต้มยำกุ้ง ":    320,
                              "ก๋วยเตี๋ยวเนื้อสับ  ":    370,
                              "ก๋วยเตี๋ยวผัดกระเพราไก่ ":    440,
                              "ก๋วยเตี๋ยวผัดไทยกุ้งสดใส่ไข่ ":    545,
                              "ก๋วยเตี๋ยวราดหน้าปลากระพง ":    435,
                              "ก๋วยเตี๋ยวเรือน้ำตกน้ำ ":    180,
                              "ก๋วยเตี๋ยวเรือน้ำตกแห้ง ":    225,
                              "ก๋วยเตี๋ยวเส้นปลา  ":    375,
                              "ก๋วยเตี๋ยวเส้นปลาแห้ง ":    420,
                              "ก๋วยเตี๋ยวเส้นเล็กต้มยำหมู ":    335,
                              "ก๋วยเตี๋ยวเส้นเล็กหมูแห้ง ":    330,
                              "ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าหมู น":    405,
                              "ก๋วยเตี๋ยวหลอด ":    225,
                              "เกาเหลาลูกชิ้นน้ำใส ":    225,
                              "เกี๊ยวกรอบราดหน้ากุ้ง ":    635,
                              "เกี๊ยวน้ำกุ้ง ":    275,
                              "เกี๊ยวปลาน้ำ ":    165,
                              "โกยซีหมี่ ":    550,
                              "ขนมจีนซาวน้ำ ":    320,
                              "ขนมจีนน้ำเงี้ยว ":    305,
                              "ขนมจีนน้ำพริก ":    450,
                              "ขนมจีนน้ำยา ":    375,
                              "ขนมหัวผักกาดผัด  ":    560,
                              "ขนมหัวผักกาดผัดใส่ไข่ ":    630,
                              "ข้าวซอยไก่, หมู ":    395,
                          "ข้าวปุ้น(ส้มตำ – ขนมจีน) ":    180,
                          "บะหมี่กรอบราดหน้า":    690,
                          "มาม่าผัดกระเพราหมู":    540,
                          "มาม่าผัดขี้เมา ": 530,
                          "บะหมี่เกี๊ยวเป็ดย่าง":415,
                          "บะหมี่เกี๊ยวหมูแดง - น้ำ": 305,
                          "บะหมี่น่องไก่ - น้ำ": 375,
                          "บะหมี่เป็ดน้ำ": 370,
                          "บะหมี่แห้งหมูแดง": 345,
                          "ผัดไทย":565,
                          "ผัดไทยไร้เส้น":350,
                          "เฝอ": 240,
                          "มักกะโรนีขี้เมาไก่": 520,
                          "มักกะโรนีผัดกุ้ง":420,
                          "ยากิโซบะ":400,
                          "เส้นเล็กเย็นตาโฟน้ำ":290,
                          "วุ้นเส้นผัดไทยกุ้งสด":520,
                          "สปาเกตตี้กระเพรากุ้ง":485,
                          "สปาเก็ตตี้ไก่อบ":430,
                          "สุกี้กี้ไก่น้ำ":345,
                          "สุกีกี้แห้งทะเล": 280,
                          "เส้นหมี่ลูกชิ้นหมูน้ำใส":225,
                          "เส้นหมี่ลูกชิ้นหมูแห้ง":430,
                          "ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าหมู, ไก่":397,
                           "เส้นหมี่ลูกชิ้นเนื้อวัวน้ำ":226,
                           "เส้นใหญ่ผัดซีอิ๊วหมูใส่ไข่":679,
                           "ก๋วยเตี๋ยวเส้นใหญ่ราดหน้ากุ้ง":292,
                           "ก๋วยเตี๋ยวเส้นใหญ่เย็นตาโฟน้ำ":352,
                           "ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าไก่": 385,
                           "ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าหมู":397,
                            "ก๋วยเตี๋ยวเส้นเล็กแห้งหมู":530,
                           "ก๋วยเตี๋ยวผัดไทยไส่ไข่":577,
                           "ก๋วยจั๊บน้ำใส":259,
                           "ก๋วยจั๊บน้ำข้น":279,
                            "เส้นหมี่เนื้อเปื่อยน้ำ":298,
                            "สุกี้ยากี้รวมมิตร":925,
                             "ข้าวหน้าเทมปุระ": 880,
                             "ข้าวหน้าไก่โอยาโกะด้ง":690,
                              "ข้าวหน้าหมูทอดคัทซึด้ง":1020,
                              "ซูชิหน้าแซลมอน":53,
                               'สลัดไก่': 300,
                            'สปาเก๊ตตี้โบโลเนส': 500,
                            'แซลมอนย่าง': 400,
                            'บะหมี่ผัดเจ': 350,
                             'สลัดคีนัว': 450,
        },
        'ของหวาน': {
            "กล้วยไข่เชื่อม":420,
        "ขนมเบื้องไทยไส้หวาน": 300,
            "ขนมครก":300,
        "ขนมถ้วย":500,
            "ปาท่องโก๋จิ้มนม": 290,
        "กล้วยทอด":510,            "ขนมสอดไส้":380,
        "ขนมชั้น":270,
            "ข้าวต้มมัด": 285,
        "ข้าวเหนียวทุเรียน": 340,
            "ข้าวเหนียวมะม่วง":  325,
        "ข้าวเหนียวสังขยา":  370,
            "ทองหยิบ":500,
        "บัวลอย":  230,
            "กล้วยบวชชี": 250,
        "รวมมิตร": 260,
            "ลอดช่องน้ำกะทิ": 230,
        "สังขยาฟักทอง": 310,
            "ไอศกรีมกะทิ": 330,
        "โดนัท":280,
            "บูลเบอร์รี่ชีสเค้ก": 340,
        "พายสับปะรด / พายแอปเปิ้ล": 480,
            "ฟรุตเค้ก": 400,
        "คุ้กกี้":240,
            "บราวนี่": 350,
        "เค้กกล้วยหอม": 350,
            "เค้กเนยสด": 400,
        "เอแคลร์ไส้ครีม": 200,
            "แบล็กฟลอเรสต์เค้ก": 490,
        "บลูเบอร์รี่ชีสพาย": 580,
            "ไอศกรีมเชอร์เบต": 100,
            "แพนเค้ก":344,
              "มัฟฟิน":378,
              "คัพเค้ก":305,
              "มาการอง":100,
              "เครป":200,
              "วาฟเฟิล":179,
            'เต้าฮวยฟรุตสลัด': 200,
            'ชีสเค้ก': 350,
        },
        'เครื่องดื่ม': {
            "นมเย็น":425,"มิลก์เชก":393,"ชานมไข่มุก":350,"โกโก้เย็น":334,"ชาเขียวเย็น":319,"ชานมเย็น":319,
            "กาแฟเย็น":317,"ชามะนาว":220,"น้ำมะพร้าวผสมเนื้อ":150,"น้ำอัดลม":130,"น้ำมะเขือเทศ":60,
            "โอเลี้ยง":140,"น้ำส้มคั้น":120,"ชามะนาว":100,"นมจืด(ไขมัน0 %)": 80,"น้ำเต้าหู้(จืด)":75,
            "ชาร้อน":55,"สมูทตี้":225,"นมเปรี้ยว":125,"น้ำแตงโมปั่น":120,"น้ำมะพร้าวปั่น":530,
            "น้ำกล้วยปั่น":330,"น้ำส้มปั่น":290,"น้ำบลูเบอร์รี่ปั่น":290,"น้ำสตอว์เบอร์รี่ปั่น":270,
            "น้ำกีวี่ปั่น":250,"น้ำสับปะรดปั่น":310,"น้ำอโวคาโด้ปั่น":162,


        },
    }

    # Check if there are valid dishes
    if not dishes:
        return "No dishes available."

    for meal_number in range(1, num_meals + 1):
        meal_calories = restricted_calories * (percentage_distribution[meal_number - 1] / 100)
        meal_result = f"มื้อที่่ {meal_number}:\nพลังงานรวม: {meal_calories:.2f} kcal\n"

        for category, category_dishes in dishes.items():
            selected_dish = random.choice(list(category_dishes.keys()))
            dish_calories = category_dishes[selected_dish]

            # Calculate portion size based on fixed percentages
            portion_size = {'จานหลัก': 0.8, 'ของหวาน': 0.1, 'เครื่องดื่ม': 0.1}[
                               category] * 250 * meal_calories / dish_calories

            # Update total selected calories
            total_selected_calories = portion_size * dish_calories

            meal_result += f"{category} - อาหารแนะนำ: {selected_dish}\n"
            meal_result += f"ปริมาณ: {portion_size:.2f} กรัม\n\n"

        print(meal_result)


# Get user input for restricted calories, number of meals, and percentage distribution
try:
    restricted_calories = int(input("พลังงานจากอาหารที่ท่านจำกัดต่อวันเท่ากับ: "))
    num_meals = int(input("จำนวนมื้ออาหารที่ท่านต้องการต่อวันเท่ากับ: "))

    # Get percentage distribution for each meal
    percentage_distribution = [float(input(f"สัดส่วนพลังงานที่ท่านต้องการจากมื้อที่ {meal_number} เท่ากับ: ")) for
                               meal_number in range(1, num_meals + 1)]

    # Check if the total percentage is 100
    if sum(percentage_distribution) != 100:
        print("เกิดข้อผิดพลาด:สัดส่วนพลังงานรวมกันทั้งหมดต้องเท่ากับ 100.")
    else:
        generate_meal_with_portion(restricted_calories, num_meals, percentage_distribution)

except ValueError:
    print("Please enter valid numbers for restricted calories, number of meals, and percentage distribution.")
